TestCases/VaporSlug/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 307.15;

boundaryField
{
  
    Base
    {
        //type fixedValue;
        //value uniform 313.15;
        type fixedGradient;
        gradient uniform 8E5;    //  6.0 W/cm2
    }
    
    Walls
    {
        type            zeroGradient;
        value           uniform 307.15;
    }

    Inlet
    {
        type            zeroGradient;
        value           uniform 307.15;
    }

    Outlet
    {
        type            zeroGradient;
        value           uniform 307.15;
    }

}


// ************************************************************************* //
