TestCases/VaporSlug/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Base
    {
        type        noSlip;
    }
    
    Walls
    {
        type        noSlip;
    }

    Inlet
    {
        type        fixedValue;   
        value       uniform (0.2 0 0); 
    }

    Outlet
    {
        type        zeroGradient;   
    }

}


// ************************************************************************* //
