TestCases/VaporSlug/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.100       -0.0005          0)
    ( 0.100       -0.0005          0)
    ( 0.100        0.0005          0)
    (-0.100        0.0005          0)
    (-0.100       -0.0005       0.01)
    ( 0.100       -0.0005       0.01)
    ( 0.100        0.0005       0.01)
    (-0.100        0.0005       0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 1 4) simpleGrading (1 1 1)       // 2 mm 
);


edges
(
);

boundary
(

    Base
    {
        type    wall;
        faces
        (
            (0 3 2 1)
        );
    }
    
    Inlet 
    {
        type    patch;
        faces
        (
            (0 4 7 3)  
        );
    }
    
    Outlet 
    {
        type    patch;
        faces
        (
            (1 2 6 5)  
        );
    }
    
    Walls
    {
        type    wall;
        faces
        (
            (0 1 5 4)  
            (4 5 6 7)
            (2 3 7 6)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
